self/20250610-the-most-hated-ally.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Most Hated Ally</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/theme/style.css" />
</head>
<body>
<div id="preamble" class="status">
<header>
  <h1><a href="/">thisago's blog</a></h1>
</header>
</div>
<div id="content" class="content">
<h1 class="title">The Most Hated Ally</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1ce8ef6">Humility</a></li>
<li><a href="#org9bf9245">Should I Fear?</a></li>
<li><a href="#orgc4c8538">So, Could I be a Jerk?</a></li>
<li><a href="#orga84bbe3">Do Not Throw Them Away!</a></li>
<li><a href="#org7cf8fbb">The "Good" News</a></li>
<li><a href="#org5f49e24">Outro</a></li>
</ul>
</div>
</div>
<blockquote>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><code></code></td>
</tr>
</tbody>
</table>

<p>
This is a random reflection highly based on my personal experiences, take with a grain of salt.
</p>
</blockquote>

<p>
Insecurities&#x2026; We should love and take care of them. They're allies for our journey.
</p>

<div id="outline-container-org1ce8ef6" class="outline-2">
<h2 id="org1ce8ef6">Humility</h2>
<div class="outline-text-2" id="text-org1ce8ef6">
<p>
Why do children learn and grow so quickly?
</p>

<p>
Why do we start to ignore important things after adolescence?
</p>

<p>
Maybe it’s the ego growing and making our arrogance suffocate humility.
</p>

<p>
Humility is somehow the courage to admit insecurities.
</p>
</div>
</div>


<div id="outline-container-org9bf9245" class="outline-2">
<h2 id="org9bf9245">Should I Fear?</h2>
<div class="outline-text-2" id="text-org9bf9245">
<p>
Insecurity isn’t fear, but it's undeniable it can cause fear.
</p>

<p>
Fear blocks our mind, it's clear that we need to overcome the fears in life.
</p>

<p>
Makes no sense on fearing mistakes, they're an opportunity to learn and should not be blamed, except if done intentionally.
</p>

<p>
The real failure is only when we stop trying.
</p>

<p>
In this context and from my perspective, insecurity is about understanding the vastness of what you don't know, about seeing where you really stand, where you really are.
</p>
</div>
</div>


<div id="outline-container-orgc4c8538" class="outline-2">
<h2 id="orgc4c8538">So, Could I be a Jerk?</h2>
<div class="outline-text-2" id="text-orgc4c8538">
<p>
But it's also common for insecure people to be annoying and disrespectful.
</p>

<p>
Insecure people may try to take control of situations, constantly seek validation, or overstep boundaries in their interactions, dismiss alternative viewpoints, or become defensive and critical when challenged.
</p>

<p>
Insecurity can also lead to passive-aggressive behavior, envy, or attempts to undermine others in order to feel superior.
</p>

<p>
But this is an arrogant approach to handle insecurities. This is kinda an narcissism and it's poisonous to interpersonal relationships.
</p>

<p>
A healthy insecurity pushes you to improve and accept feedback.
</p>

<p>
Don’t compare your journey to others. You have your own time, just don't stop.
</p>

<p>
If you try to fake and hide your insecurities, everything gets worse. We're human, and we all know that.
</p>
</div>
</div>


<div id="outline-container-orga84bbe3" class="outline-2">
<h2 id="orga84bbe3">Do Not Throw Them Away!</h2>
<div class="outline-text-2" id="text-orga84bbe3">
<p>
In the journey of life, the climb makes our past insecurities small and insignificant, and throwing them away feels like an easy thing to do.
</p>

<p>
As they make us feel bad in the present, we ask: Why am I bringing this with me? Why not get rid of this discomfort?
</p>

<p>
Unfortunately we're naturally ungrateful and it's normal to forget what helped us.
</p>

<p>
We forget that it was its presence that brought us so high in the climb.
</p>

<p>
So then, we throw them away. But now we start to fall, slowly.
</p>

<p>
It's like placing a sun chair on a steep mountain slope and relaxing.
</p>

<p>
In the best case, you'll slowly slip down. In the worst, you'll die from the fall.
</p>

<p>
This is a teaching from ancient wisdom books such as the Bible.
</p>

<p>
One of the greatest personal values is humility.
</p>

<p>
These ancient wisdom books talk about it. Instruct us to maintain awareness of our inabilities and weaknesses, they premeditate this fall.
</p>

<p>
You can see that great downfalls have the same cause: arrogance and the blindness it brings.
</p>

<p>
In other words, <b>the lack of <span class="underline">prudence</span>.</b>
</p>

<p>
When we have no insecurities anymore, we start to walk blindly and fall into every hole or trap.
</p>
</div>
</div>


<div id="outline-container-org7cf8fbb" class="outline-2">
<h2 id="org7cf8fbb">The "Good" News</h2>
<div class="outline-text-2" id="text-org7cf8fbb">
<p>
But don't worry too much, insecurities are all around us.
</p>

<p>
And when you start to feel dangerously arrogant or prepotent, take control back or you'll start to become blind.
</p>

<p>
Reflect on death, one of the greatest sources of insecurity. A problem that humanity is incapable of solving. Never did and never will, but always tried.
</p>

<p>
Time is short. When you realize that, it will be too late.
</p>
</div>
</div>


<div id="outline-container-org5f49e24" class="outline-2">
<h2 id="org5f49e24">Outro</h2>
<div class="outline-text-2" id="text-org5f49e24">
<p>
And keep in mind:
</p>
<ul class="org-ul">
<li><b>Everything</b> is not fine; there is always something to improve.</li>
<li>If you don't <b>do your best</b> in the present, you'll regret it in the future.</li>
<li>I'm not sure of what I'm talking about.</li>
</ul>

<p>
Everyone has insecurities. Some prefer to show it, others try to hide it.
</p>

<p>
Just be cautious not to hide from yourself and become blind. You don't have to show them, but if you fake, you'll look like a fool.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
See the source code <a href="https://github.com/thisago/blog">here</a>.
</div>
</body>
</html>
